librewolf/.librewolf/librewolf.overrides.cfg
// #+TITLE: LibreWolf Configuration
// #+PROPERTY: header-args :tangle "./.librewolf/librewolf.overrides.cfg" :tangle-mode (identity #o444) :mkdirp yes :comments both
// #+AUTO_TANGLE: t

// My LibreWolf configuration, following <https://librewolf.net/docs/settings/>.

// Enable letterboxing for fingerprinting resistance

// [[file:../README.org::+begin_src js][No heading:1]]
defaultPref("privacy.resistFingerprinting.letterboxing", true);
// No heading:1 ends here



// and Firefox Sync

// [[file:../README.org::+begin_src js][No heading:2]]
defaultPref("identity.fxaccounts.enabled", true);
// No heading:2 ends here



// along with history/download history

// [[file:../README.org::+begin_src js][No heading:3]]
defaultPref("privacy.clearOnShutdown.history", false);
defaultPref("privacy.clearOnShutdown.downloads", false);
// No heading:3 ends here
